package com.adtec.tools;

import java.io.*;
import java.util.ArrayList;
import java.util.List;

/**
 * File: SeperateTest
 *
 * @Author 王林柱
 * @Since 2018/3/19 15:20
 * @Ver 1.0
 */
public class SeperateTest {


    public static void writeFileBySep(List<String[]> list,String filePath){
        int sp = 0x1E;
        try {
            FileOutputStream io = new FileOutputStream(new File(filePath));
            for (String[] test:list) {
                int i = 0;
                for (String a : test) {
                    i++;
                    if (i == test.length){
                       a += "\r\n";
                    }
                    io.write(a.getBytes());
                    if (i != test.length){
                        io.write(sp);
                    }
                }
            }

            io.flush();
            io.close();
        } catch (FileNotFoundException e) {
            e.printStackTrace();
        } catch (IOException e) {
            e.printStackTrace();
        }
    }

    public static void main(String[] args) {
        String[] s1 = {"201810004001","平安银行·长安信托·001号家族信托","1002","银行存款","1","5010369.4000","98.8113","","","5010369.4","98.8113","","","20180302"};
        String[] s2 = {"201810004001","平安银行·长安信托·001号家族信托","100201","托管账户","2","5010369.4000","98.8113","","","5010369.4","98.8113","","","20180302"};
        String[] s3 = {"201810004001","平安银行·长安信托·001号家族信托","10020101","活期","3","5010369.4000","98.8113","","","5010369.4","98.8113","","","20180302"};
        String[] s4 = {"201810004001","平安银行·长安信托·001号家族信托","1132","应收利息","1","60775.0000","1.1986","","","60775.0000","1.1986","","","20180302"};
        String[] s5 = {"201810004001","平安银行·长安信托·001号家族信托","113205","应收持有到期投资利息","2","60775.0000","1.1986","","","60775.0000","1.1986","","","20180302"};
        String[] s6 = {"201810004001","平安银行·长安信托·001号家族信托","11320510","基金理财产品","3","60775.0000","1.1986","","","60775.0000","1.1986","","","20180302"};
        String[] s7 = {"201810004001","平安银行·长安信托·001号家族信托","1132051001","应收基金理财产品投资收益","4","60775.0000","1.1986","","","60775.0000","1.1986","","","20180302"};
        String[] s8 = {"201810004001","平安银行·长安信托·001号家族信托","1132051001ZG0008","平安汇通平安金橙财富宜居75号专项资产管理计划","5","60775.0000","1.1986","","","60775.0000","1.1986","","","20180302"};
        String[] s9 = {"201810004001","平安银行·长安信托·001号家族信托","1501","持有至到期投资","1","4950000.0000","97.6207","","","4950000.0000","97.6207","","","20180302"};
        String[] s10 = {"201810004001","平安银行·长安信托·001号家族信托","150110","基金理财产品","2","4950000.0000","97.6207","","","4950000.0000","97.6207","","","20180302"};
        String[] s11 = {"201810004001","平安银行·长安信托·001号家族信托","15011001","基金理财产品成本","3","4950000.0000","97.6207","","","4950000.0000","97.6207","","","20180302"};
        String[] s12 = {"201810004001","平安银行·长安信托·001号家族信托","15011001ZG0008","平安汇通平安金橙财富宜居75号专项资产管理计划","4","4950000.0000","97.6207","","","4950000.0000","97.6207","","","20180302"};
        String[] s13 = {"201810004001","平安银行·长安信托·001号家族信托","1503","可供出售金融资产","1","49500.0000","0.9762","","","49500.0000","0.9762","","","20180302"};
        String[] s14 = {"201810004001","平安银行·长安信托·001号家族信托","150389","保障基金投资","2","49500.0000","0.9762","","","49500.0000","0.9762","","","20180302"};
        String[] s15 = {"201810004001","平安银行·长安信托·001号家族信托","2241","其他应付款","1","5000000.0000","98.6068","","","5000000.0000","98.6068","","","20180302"};
        String[] s16 = {"201810004001","平安银行·长安信托·001号家族信托","224105","应付委托人认购款","2","5000000.0000","98.6068","","","5000000.0000","98.6068","","","20180302"};
        
        List<String[]> list1 = new ArrayList<>();
        list1.add(s1);
        list1.add(s2);
        list1.add(s3);
        list1.add(s4);
        list1.add(s5);
        list1.add(s6);
        list1.add(s7);
        list1.add(s8);
        list1.add(s9);
        list1.add(s10);
        list1.add(s11);
        list1.add(s12);
        list1.add(s13);
        list1.add(s14);
        list1.add(s15);
        list1.add(s16);

        String[] sp = {"","","","","1","","","","","","","","","20180302"};
        String[] t1 = {"201810004001","平安银行·长安信托·001号家族信托","证券投资合计:","","","4950000.0000","97.6207","","","4950000.0000","97.6207","","","20180302"};
        String[] t2 = {"201810004001","平安银行·长安信托·001号家族信托","其中股票投资:","","","","","","","","","","","20180302"};
        String[] t3 = {"201810004001","平安银行·长安信托·001号家族信托","其中债券投资:","","","","","","","","","","","20180302"};
        String[] t4 = {"201810004001","平安银行·长安信托·001号家族信托","其中基金投资:","","","4950000.0000","97.6207","","","4950000.0000","97.6207","","","20180302"};
        String[] t5 = {"201810004001","平安银行·长安信托·001号家族信托","其中权证投资:","","","","","","","","","","","20180302"};
        String[] t6 = {"201810004001","平安银行·长安信托·001号家族信托","流通股票投资合计:","","","","","","","","","","","20180302"};
        String[] t7 = {"201810004001","平安银行·长安信托·001号家族信托","新股投资合计:","","","","","","","","","","","20180302"};
        String[] t8 = {"201810004001","平安银行·长安信托·001号家族信托","今日可用头寸:","","","","","","","","","","","20180302"};
        String[] t9 = {"201810004001","平安银行·长安信托·001号家族信托","实收信托:","","","5000000.0000","","","","5000000.0000","","5000000.0000","","20180302"};
        String[] t10 = {"201810004001","平安银行·长安信托·001号家族信托","损益平准金_未实现:","","","","","","","","","","","20180302"};
        String[] t11 = {"201810004001","平安银行·长安信托·001号家族信托","损益平准金_已实现:","","","","","","","","","","","20180302"};
        String[] t12 = {"201810004001","平安银行·长安信托·001号家族信托","资产类合计:","","","10070644.4000","198.6068","","","10070644.4000","198.6068","","","20180302"};
        String[] t13 = {"201810004001","平安银行·长安信托·001号家族信托","负债类合计:","","","5000000.0000","98.6068","","","5000000.0000","98.6068","","","20180302"};

        String[] t14 = {"201810004001","平安银行·长安信托·001号家族信托","信托资产净值:","","","5070644.4000","100.0000","","","5070644.4000","100.0000","","","20180302"};
        String[] t15 = {"201810004001","平安银行·长安信托·001号家族信托","今日单位净值:","1.0141","","1.0141","","","","1.0141","","","","20180302"};
        String[] t16 = {"201810004001","平安银行·长安信托·001号家族信托","累计单位净值:","1.0141","","","","","","","1.0141","","","20180302"};
        String[] t17 = {"201810004001","平安银行·长安信托·001号家族信托","年初单位净值:","1.0000","","","","","","","","","","20180302"};
        String[] t18 = {"201810004001","平安银行·长安信托·001号家族信托","月初单位净值:","1.0136","","","","","","","","","","20180302"};
        String[] t19 = {"201810004001","平安银行·长安信托·001号家族信托","昨日单位净值:","1.0139","","","","","","","","","","20180302"};
        String[] t20 = {"201810004001","平安银行·长安信托·001号家族信托","成立以来净值增长率(%):","1.4100","","","","","","","","","","20180302"};
        String[] t21 = {"201810004001","平安银行·长安信托·001号家族信托","净值年增长率(%):","1.4100","","","","","","","","","","20180302"};
        String[] t22 = {"201810004001","平安银行·长安信托·001号家族信托","净值月增长率(%):","1.0493","","","","","","","","","","20180302"};
        String[] t23 = {"201810004001","平安银行·长安信托·001号家族信托","净值日增长率(%):","0.0197","","","","","","","","","","20180302"};
        String[] t24 = {"201810004001","平安银行·长安信托·001号家族信托","本期已实现收益:","70,644.40","","","","","","","","","","20180302"};
        String[] t25 = {"201810004001","平安银行·长安信托·001号家族信托","可分配利润:","70,644.40","","","","","","","","","","20180302"};
        String[] t26 = {"201810004001","平安银行·长安信托·001号家族信托","单位可分配利润:","0.0141","","","","","","","","","","20180302"};
        String[] t27 = {"201810004001","平安银行·长安信托·001号家族信托","累计派现金额:","0.0000","","","","","","","","","","20180302"};
        String[] t28 = {"201810004001","平安银行·长安信托·001号家族信托","现金类占净值比(%):","98.81","","","","","","","","","","20180302"};
        List<String[]> list2 = new ArrayList<>();
        list2.add(t1);
        list2.add(t2);
        list2.add(t3);
        list2.add(t4);
        list2.add(t5);
        list2.add(t6);
        list2.add(t7);
        list2.add(t8);
        list2.add(t9);
        list2.add(t10);
        list2.add(t11);
        list2.add(t12);
        list2.add(t13);
        list2.add(t14);
        list2.add(t15);
        list2.add(t16);
        list2.add(t17);
        list2.add(t18);
        list2.add(t19);
        list2.add(t20);
        list2.add(t21);
        list2.add(t22);
        list2.add(t23);
        list2.add(t24);
        list2.add(t25);
        list2.add(t26);
        list2.add(t27);
        list2.add(t28);



        // 写科目信息
        writeFileBySep(list1,"E:\\test\\INT_FTPB_VALUE_SUBJECT_20180328.txt");
        // 写统计信息
        writeFileBySep(list2,"E:\\test\\INT_FTPB_VALUE_OTHER_20180328.txt");
    }
}
